{
    "Faculty of Arts and Design": [
        {
            "course_name": "DIPLOMA IN COMMERCIAL PHOTOGRAPHY",
            "qualification_code": "DPPG20",
            "campus_where_offered": "Arts Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 3 for English (home language or first additional language).",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 22 (excluding Life Orientation)."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language) and 40% for Mathematics or Mathematical Literacy, 40% for Life Orientation (excluded for APS calculation) and 50% for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 22 (excluding Life Orientation). Assessment Procedure: Applicants who apply before the closing of the set departmental application date and who meet these minimum criteria (as listed above) will be invited to submit a portfolio for evaluation and to complete a questionnaire. The APS will contribute 20% to the final admission score, the questionnaire will contribute 30%, and the portfolio will contribute 50%. Aspects that are taken into consideration are: (i) Potential to complete the programme successfully. (ii) Successful completion of the admission requirements and questionnaire whereby the candidate will be assessed on their language proficiency, and ability to answer questions with insight. (iii) The photographic assignment will be assessed according to the following:"
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "DIPLOMA IN FASHION DESIGN AND TECHNOLOGY",
            "qualification_code": "DPFD19",
            "campus_where_offered": "Arts Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 3 for English (home language or first additional language).",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation)."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language) and 40% for Mathematics or Mathematical Literacy, 40% for Life Orientation (excluded for APS calculation), and 50% for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation). Assessment Procedure: Applicants with an APS of 20 and more will be invit- ARTS AND DESIGN contribute 20% to the final admission score, the interview will contribute 20% and the demonstration of skills will contribute 60%. Aspects that are taken into consideration are: the applicant’s ability/potential to communicate a variety of clothing styles; the applicant’s interests, attitude, experience and achievements; and school results. Acceptance is subject to available capacity according to the Student Enrolment Plan (SEP). Once a programme is full, a waiting list will be in place to provide an opportunity for applicants to fill places of those who did not register on time. Applicants will be informed of their status per official letter from the Office of the Registrar, alternatively, they can check their application status on the TUT website, www.tut.ac.za."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "DIPLOMA IN FINE AND APPLIED ARTS",
            "qualification_code": "DPFA19",
            "campus_where_offered": "Arts Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 3 for English (home language or first additional language).",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation)."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for Mathematical Literacy, 40% for Life Orientation (excluded for APS calculation), and 50% for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation). Assessment Procedure: Applicants who apply before the closing of applications and who meet the minimum criteria will be invited to submit a portfolio for evaluation, and to complete a questionnaire. The APS will contribute 20% to the final admission score, the questionnaire will contribute 30% and the portfolio will contribute 50%. Aspects that are taken into consideration are: potential to complete the quali- fication successfully; creativity; two-dimensional and three-dimensional skills; design ability; drawing skills; sense of colour; and general potential and crafts- manship. Acceptance is subject to available capacity according to the Student Enrolment Plan (SEP). Once a programme is full, a waiting list will be in place to provide an opportunity for applicants to fill places of those who did not register on time. Applicants will be informed of their status per official letter from the Office of the Registrar, alternatively, they can check their application status on the TUT website, www.tut.ac.za."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "DIPLOMA IN INTEGRATED COMMUNICATION DESIGN",
            "qualification_code": "DPCD20",
            "campus_where_offered": "Arts Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• FOR APPLICANTS WHO OBTAINED A NATIONAL SENIOR CERTIFICATE IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s achievement level of at least 4 for English (home language or first additional language).",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 24 (excluding Life Orientation)."
                    }
                },
                {
                    "• FOR APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma, or a higher certificate endorsement, with at least 50% for English (home language or first additional language) and 40% for Mathematics or Mathematical Literacy, 40% for Life Orientation (excluded for APS calculation) and 50% for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 24 (excluding Life Orientation). Assessment Procedure: After passing the initial administrative screening, all applicants will sit for additional assessment arranged with the Department of Visual Communication. The purpose of the assessment is to select those appli- cants who are most likely to be successful in their studies in Communication Design. The University reserves the right to select the best candidates for this programme. Please contact the department for information pertaining to the assessment. Acceptance is subject to available capacity according to the Student Enrolment Plan (SEP). Once a programme is full, a waiting list will be in place to provide an opportunity for applicants to fill places of those who did not register on time. Applicants will be informed of their status per official letter from the Office of the Registrar, alternatively, they can check their application status on the TUT website, www.tut.ac.za."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "DIPLOMA IN INTERIOR DESIGN",
            "qualification_code": "DPID20",
            "campus_where_offered": "Arts Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 3 for English (home language or first additional language).",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation)."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language) and 40% for Mathematics or Mathematical Literacy, 40% for Life Orientation (excluded for APS calculation), and 50% for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 27 (excluding Life Orientation). Assessment Procedure: Applicants who apply before the closing of applications and who meet the minimum criteria will be invited to submit a portfolio for evaluation, to attend a practical selection process, and to complete a question- naire. The portfolio will contribute 35%, an interview based upon a question- naire answered by the candidate, 30%, and the completion of the basic skills demonstration, 35% to the selection score. Aspects that are taken into consideration are: potential to complete the programme successfully; creativity; two-dimensional and three-dimensional skills; ability to demonstrate basic skills sets in working with materials; design ability; drawing skills; sense of colour, and general potential and craftsmanship. Plan (SEP). Once a programme is full, a waiting list will be in place to provide an opportunity for applicants to fill places of those who did not register on time. Applicants will be informed of their status per official letter from the Office of the Registrar, alternatively, they can check their application status on the TUT website, www.tut.ac.za."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "DIPLOMA IN MOTION PICTURE PRODUCTION",
            "qualification_code": "DPMO20",
            "campus_where_offered": "Arts Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• FOR APPLICANTS WHO OBTAINED A NATIONAL SENIOR CERTIFICATE IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language).",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 22 (excluding Life Orientation)."
                    }
                },
                {
                    "• FOR APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language) and 40% for Mathematics or Mathematical Literacy, 40% for Life Orientation (excluded for APS calculation) and 50% for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 22 (excluding Life Orientation). Assessment Procedure: Admission is based on APS score, an artistic submis- sion will contribute 40% and the interview will contribute 20% of the final score. Acceptance is subject to available capacity according to the Student Enrolment Plan (SEP). Once a programme is full, a waiting list will be in place to provide an opportunity for applicants to fill places of those who did not register on time. Applicants will be informed of their status per official letter from the Office of the Registrar, alternatively, they can check their application status on the TUT website, www.tut.ac.za."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "HIGHER CERTIFICATE IN MUSIC",
            "qualification_code": "HCMU20",
            "campus_where_offered": "Arts Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree, or a diploma, or a higher certificate endorsement or an equivalent qualification, with an achievement level of at least 3 for English (home language or first additional language).",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 18 (excluding Life Orientation)."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma, or a higher certificate endorsement, with at least 40% for English (home language or first additional language).",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 18 (excluding Life Orientation). Assessment procedure(s): Admission is subject to an evaluation. Applicants who comply with the minimum requirements will be required to - - Perform an audition (either vocal or on their instrument of choice); and - Attend an interview. Acceptance is subject to available capacity according to the Student Enrolment Plan (SEP). Once a programme is full, a waiting list will be in place to provide an opportunity for applicants to fill places of those who did not register on time. Applicants will be informed of their status per official letter from the Office of the Registrar, alternatively, they can check their application status on the TUT website, www.tut.ac.za."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "One year.",
            "closing_date_for_application": "31 July."
        }
    ],
    "Faculty of Economics and Finance": [
        {
            "course_name": "DIPLOMA IN ACCOUNTING",
            "qualification_code": "DPAG20",
            "campus_where_offered": "Ga-Rankuwa, Mbombela and Polokwane Campuses.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WHO OBTAINED A NATIONAL SENIOR CERTIFICATE IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree, or a diploma endorsement or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language), 3 for Accounting or 3 for Mathematics or Technical Mathematics or 5 for Mathematical Literacy.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 22 or at least 24 (with Mathematical Literacy). Life Orientation is excluded for APS calculation."
                    }
                },
                {
                    "• FOR APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language) and 40% for Mathematics or 60% for Mathematical Literacy, 40% for Life Orientation (excluded for APS calculation), and 50% for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 22 or at least 24 (with Mathematical Literacy). Life Orientation is excluded for APS calculation."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "DIPLOMA IN FINANCIAL MANAGEMENT",
            "qualification_code": "DPFC20",
            "campus_where_offered": "Ga-Rankuwa, Mbombela and Polokwane Campuses.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WHO OBTAINED A NATIONAL SENIOR CERTIFICATE IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language), 3 for Accounting or 3 for Mathematics or Technical Mathematics or 5 for Mathematical Literacy.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 22 or at least 24 (with Mathematical Literacy). Life Orientation is excluded for APS calculation."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language) and 40% for Mathematics or 60% for Mathematical Literacy, 40% for Life Orientation (excluded for APS calculation), and 50% for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 22 or at least 24 (with Mathematical Literacy). Life Orientation is excluded for APS calculation."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN INTERNAL AUDITING",
            "qualification_code": "DPIA20",
            "campus_where_offered": "Ga-Rankuwa, Mbombela and Polokwane Campuses.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WHO OBTAINED A NATIONAL SENIOR CERTIFICATE IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language), 3 for Accounting or 3 for Mathematics or Technical Mathematics or 5 for Mathematical Literacy.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 22 or at least 24 (with Mathematical Literacy). Life Orientation is excluded for APS calculation"
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language) and 40% for Mathematics or 60% for Mathematical Literacy, 40% for Life Orientation (excluded for APS calculation), and 50% for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 22 or at least 24 (with Mathematical Literacy). Life Orientation is excluded for APS calculation."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN PUBLIC FINANCE",
            "qualification_code": "DPPF20",
            "campus_where_offered": "Ga-Rankuwa, Mbombela and Polokwane Campuses.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• FOR APPLICANTS WHO OBTAINED A NATIONAL SENIOR CERTIFICATE IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree, or a diploma, endorsement or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language), 4 for Accounting or 3 for Mathematics or Technical Mathematics or 5 for Mathematical Literacy.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 23 (with Accounting), or at least 22 (with Mathematics or Technical Mathematics), or at least 24 (with Mathematical Literacy). Life Orientation is excluded for APS calculation."
                    }
                },
                {
                    "• FOR APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for or 60% for Mathematical Literacy, 40% for Life Orientation (excluded for APS calculation), and 50% for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) at least 22 (with Mathematics), or at least 24 (with Mathematical Literacy). Life Orientation is excluded for APS calculation."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "HIGHER CERTIFICATE IN ACCOUNTING",
            "qualification_code": "HCAG20",
            "campus_where_offered": "Ga-Rankuwa Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• FOR APPLICANTS WHO OBTAINED A NATIONAL SENIOR CERTIFICATE IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree, or a diploma, or a higher certificate endorsement or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language) and 3 for Mathematics or Technical Mathematics or 4 for Mathematical Literacy.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 22 or at least 23 (with Mathematical Literacy)."
                    }
                },
                {
                    "• FOR APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree, or a diploma, or a higher certificate endorsement, or an equivalent qualification, with at least 50% for English (home language or first additional language) and 40% for Mathematics or 50% for Mathematical Literacy, 40% for Life Orientation (excluded for APS calculation) and 50% for any other three compulsory vocational modules.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 22 or at least 23 (with Mathematical Literacy)."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "One year.",
            "closing_date_for_application": "30 September."
        }
    ],
    "Faculty of Engineering and the Built": [
        {
            "course_name": "BACHELOR OF ARCHITECTURE",
            "qualification_code": "BPAR20",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate, with a bachelor’s degree endorsement (four subjects with a minimum score of 4 in the subjects), or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language).",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 25."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4, with a bachelor’s degree endorsement, issued by the Council for Quality Assur- ance in General and Further Education and Training (Umalusi), with at least 50% (APS of 4) for English, 50% (APS of 4) for Mathematics or Mathematical Literacy, 50% for Life Orientation (excluded for APS calculation) and at least 60% (APS of 5) for any four other vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 25."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes. Classes and assessments may take place on Friday",
            "minimum_duration": "Four years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "BACHELOR OF ARCHITECTURE",
            "qualification_code": "BPARF2",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate, with a bachelor’s degree endorsement (four subjects with a minimum score of 4 in the subjects), or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language).",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 25."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4, ENGINEERING AND THE BUILT ENVIRONMENT ance in General and Further Education and Training (Umalusi), with at least 50% (APS of 4) for English, 50% (APS of 4) for Mathematics or Mathematical Literacy, 50% for Life Orientation (excluded for APS calculation) and at least 60% (APS of 5) for any four other vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 25."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes. Classes and assessments may take place on Friday",
            "minimum_duration": "Five years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "BACHELOR OF GEOMATICS",
            "qualification_code": "BPGM20",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate or an equivalent quali- fication, with a bachelor’s degree endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language), 5 for Mathematics or Technical Mathematics, and 4 for Physical Sciences or Technical Sciences.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 25 (excluding Life Orientation)."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL N CERTIFICATE/NATIONAL SENIOR CERTIFICATE AS PUBLISHED IN REPORT 191": {
                        "Admission requirement(s)": "A National Senior Certificate or a National N Certifi- cate with languages as published in Report 191: N3 (NQF Level 4) issued by both the Department of Higher Education and Training (DHET) and the Council for Quality Assurance in General and Further Education and Training (Umalusi), with at least 50% for English, Mathematics N3, Engineering Sciences N3 and any other two additional subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 25. Recommended subject(s): None."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "BACHELOR OF ENGINEERING TECHNOLOGY IN CIVIL ENGINEERING",
            "qualification_code": "BPCE18",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate or an equivalent quali- fication, with a bachelor’s degree endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language) and 5 for Mathematics or Technical Mathematics, and 5 for Physical Sciences or Technical Sciences.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 28 (excluding Life Orientation). Recommended subjects: Engineering Graphics and Design and Mechanical Technology."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4, with a bachelor’s degree endorsement, issued by the Council for Quality Assur- ance in General and Further Education and Training (Umalusi), with at least a 50% (APS of 4) for English, 50% for Life Orientation (excluded for APS calcula- tion), and 60% (APS of 5) for Mathematics and Science, and 60% (APS of 5) for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 28 (excluding Life Orientation). Recommended subject(s): None."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL N CERTIFICATE/NATIONAL SENIOR CERTIFICATE AS PUBLISHED IN REPORT 191": {
                        "Admission requirement(s)": "A National Senior Certificate or a National N Certifi- cate with languages as published in Report 191: N3 (NQF Level 4) issued by both the Department of Higher Education and Training (DHET) and the Council for Quality Assurance in General and Further Education and Training (Umalusi), with at least 50% for English, Mathematics N3, Engineering Sciences N3 and any other two additional subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 28. Recommended subject(s): None."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "BACHELOR OF ENGINEERING TECHNOLOGY IN INDUSTRIAL ENGINEERING",
            "qualification_code": "BPIE19",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate or an equivalent quali- fication, with a bachelor’s degree endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language) and 5 for Mathematics or Technical Mathematics, and 5 for Physical Sciences or Technical Sciences.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 28 (excluding Life Orientation). Recommended subjects: Engineering Graphics and Design and Mechanical Technology."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4, with a bachelor’s degree endorsement, issued by the Council for Quality Assur- ance in General and Further Education and Training (Umalusi), with at least a 50% (APS of 4) for English, 50% for Life Orientation (excluded for APS calcula- tion), and 60% (APS of 5) for Mathematics and Science, and 60% (APS of 5) for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 28 (excluding Life Orientation). Recommended subject(s): None."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL N CERTIFICATE/NATIONAL SENIOR CERTIFICATE AS PUBLISHED IN REPORT 191": {
                        "Admission requirement(s)": "A National Senior Certificate or a National N Certifi- cate with languages as published in Report 191: N3 (NQF Level 4) issued by both the Department of Higher Education and Training (DHET) and the Council for with at least 50% for English, Mathematics N3, Engineering Sciences N3 and any other two additional subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 28. Recommended subject(s): None."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "BACHELOR OF ENGINEERING TECHNOLOGY IN MECHANICAL ENGINEERING",
            "qualification_code": "BPME18",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate or an equivalent quali- fication, with a bachelor’s degree endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language) and 5 for Mathematics or Technical Mathematics, and 5 for Physical Sciences or Technical Sciences.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 28 (excluding Life Orientation). Recommended subjects: Engineering Graphics and Design and Mechanical Technology."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4, with a bachelor’s degree endorsement, issued by the Council for Quality Assur- 50% (APS of 4) for English, 50% for Life Orientation (excluded for APS calcula- tion), and 60% (APS of 5) for Mathematics and Science, and 60% (APS of 5) for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 28 (excluding Life Orientation). Recommended subject(s): None."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL N CERTIFICATE/NATIONAL SENIOR CERTIFICATE AS PUBLISHED IN REPORT 191": {
                        "Admission requirement(s)": "A National Senior Certificate or a National N Certifi- cate with languages as published in Report 191: N3 (NQF Level 4) issued by both the Department of Higher Education and Training (DHET) and the Council for Quality Assurance in General and Further Education and Training (Umalusi), with at least 50% for English, Mathematics N3, Engineering Sciences N3 and any other two additional subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 28. Recommended subject(s): None."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "BACHELOR OF ENGINEERING TECHNOLOGY IN METALLURGICAL",
            "qualification_code": "BPML20",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate or an equivalent quali- fication, with a bachelor’s degree endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first Physical Sciences or Technical Sciences.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 28 (excluding Life Orientation). Recommended subjects: Engineering Graphics and Design, and Mechanical Technology."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4, with a bachelor’s degree endorsement, issued by the Council for Quality Assur- ance in General and Further Education and Training (Umalusi) with at least a 50% (APS of 4) for English, 50% for Life Orientation (excluded for APS calcula- tion), and 60% (APS of 5) for Mathematics and Science, and 60% (APS of 5) for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 28 (excluding Life Orientation). Recommended subject(s): None."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL N CERTIFICATE/NATIONAL SENIOR CERTIFICATE AS PUBLISHED IN REPORT 191": {
                        "Admission requirement(s)": "A National Senior Certificate or a National N Certifi- cate with languages as published in Report 191: N3 (NQF Level 4) issued by both the Department of Higher Education and Training (DHET) and the Council for Quality Assurance in General and Further Education and Training (Umalusi), with at least 50% for English, Mathematics N3, Engineering Sciences N3 and any other two additional subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 28. Recommended subject(s): None."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN ELECTRICAL ENGINEERING",
            "qualification_code": "DPEE20",
            "campus_where_offered": "Pretoria and eMalahleni campuses.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate or an equivalent quali- fication, with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language), 4 for Mathematics or Technical Mathematics, and 4 for Physical Sciences or Technical Sciences. Recommended subject(s): Electrical Technology and Engineering Graphics and Design.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 26 (excluding Life Orientation)."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4, with a bachelor’s degree or a diploma endorsement, issued by the Council for Quality Assurance in General and Further Education and Training (Umalusi) with at least a 50% (APS of 4) for English, 50% for Life Orientation (excluded for APS calculation), and 60% (APS of 5) for Mathematics and Science, and 50% (APS of 4) for any two compulsory vocational subjects. Recommended subject(s): Electrical Principles and Practice, Electrical Systems and Construction Electrical Workmanship, Electronic Control and Digital Electronics.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 26 (excluding Life Orientation)."
                    }
                }
            ],
            "intake_for_qualification": "January and July (July intake is only applicable",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN INDUSTRIAL DESIGN",
            "qualification_code": "DIND18",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate, with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language).",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 21. Assessment Procedure: All applications meeting the minimum requirements will be required to submit a prescribed portfolio. All completed applications received within the published due dates will be the top ranking applicants will be selected. Once a programme is full, a waiting list will be in place to provide an opportunity for applicants to fill places of those who did not register on time. Applicants will be informed of their status per official letter from the Office of the Registrar, alternatively, they can check their application status on the TUT website, www.tut.ac.za."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes. Classes and assessments may take place on Friday",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "HIGHER CERTIFICATE IN CONSTRUCTION ENGINEERING",
            "qualification_code": "HCCE18",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree, or a diploma, or a higher certificate endorsement or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language) and Mathematics or Technical Mathematics, and at least a 3 for Physical Sciences or Technical Sciences. Applicants who do not meet the requirements for Mathematics, Physical Scienc- es, or any of the two additional subjects may enroll for these subjects at any Technical and Vocational Education and Training (TVET) College (see National N Certificate requirements), and if these are successfully passed at a perfor- mance level of at least 50%, they may re-apply for admission to the University.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation). Recommended subject(s): Civil Technology and Engineering Graphics and Design."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL N CERTIFICATE/NATIONAL SENIOR CERTIFICATE AS PUBLISHED IN REPORT 191": {
                        "Admission requirement(s)": "A National Senior Certificate or a National N Certifi- cate with languages as published in Report 191: N3 (NQF Level 4) issued by both the Department of Higher Education and Training (DHET) and the Council for Quality Assurance in General and Further Education and Training (Umalusi), with at least 50% for English, Mathematics N3, Engineering Sciences N3 and any other two additional subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation). Recommended subject(s): None."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes. Classes and assessments may take place on Friday",
            "minimum_duration": "One year.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "HIGHER CERTIFICATE IN INDUSTRIAL ENGINEERING",
            "qualification_code": "HCIE18",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree, or a diploma, or a higher certificate endorsement or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language) and Mathematics or Technical Mathematics, and at least a 3 for Physical Sciences or Technical Sciences. Applicants who do not meet the requirements for Mathematics, Physical Scienc- es, or any of the two additional subjects may enroll for these subjects at any Technical and Vocational Education and Training (TVET) College (see National N Certificate requirements), and if these are successfully passed at a perfor- mance level of at least 50%, they may re-apply for admission to the University.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation). Recommended subject(s): Mechanical Technology."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4, with a bachelor’s degree or a diploma, or a higher certificate endorsement, issued by the Council for Quality Assurance in General and Further Education and Training (Umalusi), with at least 50% (APS of 4) for English and Mathemat- ics, and 50% for Life Orientation (excluded for APS calculation) and 40% (APS of 3) for Science, and any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation). Recommended subject(s): None."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL N CERTIFICATE/NATIONAL SENIOR CERTIFICATE AS PUBLISHED IN REPORT 191": {
                        "Admission requirement(s)": "A National Senior Certificate or a National N Certifi- cate with languages as published in Report 191: N3 (NQF Level 4) issued by both the Department of Higher Education and Training (DHET) and the Council for Quality Assurance in General and Further Education and Training (Umalusi), with at least 50% for English, Mathematics N3, Engineering Sciences N3 and any",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation). Recommended subject(s): None."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes. Classes and assessments may take place on Friday",
            "minimum_duration": "One year.",
            "closing_date_for_application": "30 September."
        }
    ],
    "Faculty of Humanities": [
        {
            "course_name": "BACHELOR OF EDUCATION IN FOUNDATION PHASE TEACHING",
            "qualification_code": "BPFN20",
            "campus_where_offered": "Soshanguve North Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• FOR APPLICANTS WHO OBTAINED A NATIONAL SENIOR CERTIFICATE IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree endorsement, or an equivalent qualification, with an achievement level of at least 5 for home language and 4 for the first additional language, and at least 4 for Mathematics or 5 for Mathematical Literacy.",
                        "Selection criteria": "To be considered for this qualification, Applicants must have an Admission Points Score (APS) of at least 25 (excluding Life Orientation). Assessment Procedure: No further assessment will be done. Applicants who achieve the minimum APS will be considered until the programme complement is full. All completed applications received within the published due dates will be ranked. After consideration of the Departmental Student Enrolment Plan, only the top ranking applicants will be selected. Once a programme is full, a waiting list will be in place to provide an opportunity for applicants to fill places of those who did not register on time. Applicants will be informed of their status per official letter from the Office of the Registrar, alternatively, they can check their application status on the TUT website, www.tut.ac.za."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Four years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "BACHELOR OF EDUCATION IN SENIOR PHASE AND FURTHER EDUCATION",
            "qualification_code": "BPSA20",
            "campus_where_offered": "Soshanguve North Campus",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WHO OBTAINED A NATIONAL SENIOR CERTIFICATE IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor ’s degree endorsement, or an equivalent qualification with an achievement level of at least 4 in English (home language or first additional language), and 4 for Mathematics, Mathematical Literacy or Technical Mathematics and Consumer Studies or Hospitality Studies or Tourism. The following subject specific-prerequisite in the FET/Senior Certificate is compulsory for applicants who intend to enrol for this qualification. Speciali- sation modules are offered in different groups and applicants must meet the requirements accordingly: Specialisation modules Specific prerequisite(s) offered in the programme on NQF Level 4 Consumer Studies or Hospitality Studies with a FET: Consumer Studies I minimum score of 4 Hospitality Studies or Consumer Studies with a FET: Hospitality Studies I minimum score of 4 Mathematics or Technical Mathematics or Mathe- FET: Mathematical Literacy I matical Literacy with a minimum score of 4 FET: Tourism I Tourism with a minimum score of 4",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Points Score (APS) of at least 24 (excluding Life Orientation)."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Four years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "BACHELOR OF EDUCATION IN SENIOR PHASE AND FURTHER EDUCATION",
            "qualification_code": "BPSI20",
            "campus_where_offered": "Soshanguve North Campus",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WHO OBTAINED A NATIONAL SENIOR CERTIFICATE IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree endorsement, or an equivalent qualification with an achievement level of at least 4 in English (home language or first additional language), and 4 for Mathematics or Technical Mathematics or Information Technology. The following subject specific-prerequisite in the FET/Senior Certificate is compulsory for applicants who intend to enrol for this qualification. Speciali- sation modules are offered in different groups and applicants must meet the requirements accordingly: Specialisation modules Specific prerequisite(s) offered in the programme on NQF Level 4 FET: Computer Application Technology I No requirement Information Technology or Mathematics or FET: Information Technology I Technical Mathematics with a minimum score of 4",
                        "Selection criteria": "To be considered for this qualification, applicants must have"
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4, with a bachelor’s degree endorsement, issued by the Council for Quality Assurance in General and Further Education and Training (Umalusi) with at least a 50% (APS of 4) for English (home language or first additional language), Mathematics, and Life Orientation (excluded for APS calculation) and at least 60% (APS of 5) for Systems Analysis and Design and Data Communications and Computer Programming and any other vocational subject.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Points Score (APS) of at least 28 (excluding Life Orientation). Assessment Procedure: No further assessment will be done. Applicants who achieve the minimum APS will be considered until the programme complement is full. All completed applications received within the published due dates will be ranked. After consideration of the Departmental Student Enrolment Plan, only the top ranking applicants will be selected. Once a programme is full, a waiting list will be in place to provide an opportunity for applicants to fill places of those who did not register on time. Applicants will be informed of their status per official letter from the Office of the Registrar, alternatively, they can check their application status on the TUT website, www.tut.ac.za."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Four years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "BACHELOR OF EDUCATION IN SENIOR PHASE AND FURTHER",
            "qualification_code": "BPSP20",
            "campus_where_offered": "Soshanguve North Campus",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WHO OBTAINED A NATIONAL SENIOR CERTIFICATE IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree endorsement, or an equivalent qualification with an achievement level of at least 4 in English (home language or first additional language) and a 4 for Mathematics and Life Sciences or Physical Sciences. The following subject specific-prerequisite in the FET/Senior Certificate is compulsory for applicants who intend to enrol for this qualification. Speciali- sation modules are offered in different groups and applicants must meet the requirements accordingly: Specialisation modules Specific prerequisite(s) offered in the programme on NQF Level 4 FET: Life Sciences I Life Sciences with a minimum score of 4 FET: Mathematics I Mathematics with a minimum score of 4 FET: Physical Sciences I Physical Sciences with a minimum score of 4",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Points Score (APS) of at least 24 (excluding Life Orientation)."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4, with a bachelor’s degree endorsement, issued by the Council for Quality Assur- ance in General and Further Education and Training (Umalusi) with at least a 50% (APS of 4) for English (home language or first additional language), Mathe- matics, and Life Orientation (excluded for APS calculation) and at least 60% (APS of 5) for Physical Science and three other vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Points Score (APS) of at least 28 (excluding Life Orientation). Assessment Procedure: No further assessment will be done. Applicants who achieve the minimum APS will be considered until the programme complement is full. All completed applications received within the published due dates will be ranked. After consideration of the Departmental Student Enrolment Plan, only the top ranking applicants will be selected. Once a programme is full, a waiting list will be in place to provide an opportunity for applicants to fill places of those who did not register on time. Applicants will be informed of their status per official letter from the Office of the Registrar, alternatively, they can check their application status on the TUT website, www.tut.ac.za."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Four years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "DIPLOMA IN ADULT AND COMMUNITY EDUCATION AND TRAINING",
            "qualification_code": "DPYA23",
            "campus_where_offered": "Soshanguve North Campus",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4, with a bachelor’s degree or diploma endorsement, issued by the Council for Quality Assurance in General and Further Education and Training (Umalusi) with at least a 50% (APS of 4) for English, Mathematics or Mathematical Liiteracy and Life Orientation (excluded for APS calculation) and 60% (APS of 5) for any other three compulsary vocational subjects and 50% (APS of 4) for the fourth subject.",
                        "Selection criteria": "To be considered for this qualification, Applicants must have an Admission Points Score (APS) of at least 27 (excluding Life Orientation). Assessment procedures: No further assessment will be done. Acceptance is subject to available capacity according to the Student Enrolment Plan (SEP). Once a programme is full, a waiting list will be in place to provide an opportu- nity for applicants to fill places of those who did not register on time. Applicants will be informed of their status per official letter from the Office of the Registrar, alternatively, they can check their application status on the TUT website, www.tut.ac.za."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "15 June."
        },
        {
            "course_name": "DIPLOMA IN INTEGRATED COMMUNICATION",
            "qualification_code": "DPIC20",
            "campus_where_offered": "Soshanguve North Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma, or a higher certificate endorsement, with at least 50% for English (home language or first additional language) and 40% for Mathematics or Mathematical Literacy, 40% for Life Orientation (excluded for APS calculation) and 50% for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (with Mathematics) or 21 (with Mathematical Literacy).Life Orientation is excluded for APS calculation. Assessment procedures: Admission is based on APS score, a selection test and a personal interview. The APS will contribute 20%, the selection test will contrib- ute 50% and the interview will contribute 30% of the final score. Please take note that all completed applications received within the published due dates will be ranked. After consideration of the Departmental Student Enrolment Plan, only the top ranking applicants will be selected. Once a programme is full, a waiting list will be in place to provide an opportunity for applicants to fill places of those who did not register on time. Applicants will be informed of their status per official letter from the Office of the Registrar, alternatively, they can check their application status on the TUT website, www. tut.ac.za."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "First two years: day classes. Third year: block-mode classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "DIPLOMA IN JOURNALISM",
            "qualification_code": "DPJR20",
            "campus_where_offered": "Soshanguve North Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language). Recommended subjects: Geography, History, a third language and any art-related subject.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 24 (excluding Life Orientation)."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma, or a higher certificate endorsement, with at least 50% for English (home language or first additional language) and 40% for Mathematics or Mathematical Literacy, 40% for Life Orientation (excluded for APS calculation) and 50% for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 24 (excluding Life Orientation). Assessment Procedure: Admission is based on APS score, a selection test and a personal interview. The APS will contribute 40%, the selection test will contrib- ute 30%, and the interview will contribute 30% of the final score. - Preference will be given to applicants with a performance level of 5 or more in English. - General knowledge and language proficiency are extremely important in journalism and special emphasis will therefore be placed on these aspects during selection. - Applicants are advised to prepare themselves accordingly by, for example, reading books on journalism and the political system in South Africa, reading newspapers regularly and consulting professional journalists about the nature and requirements of the profession. - All applicants should contact the Department of Journalism of the University by telephone, by August of the year preceding the year of proposed study, to make arrangements for selection. SEITINAMUH During selection, applicants will be requested to present a portfolio of (infor- mal) media output, showcasing the candidate’s interest/ability in Journalism. This may include examples of freelance articles, essays, recordings of broad- cast participation, and online presence such as blogs, FB-pages and Twitter. Please take note that all completed applications received within the published due dates will be ranked. After consideration of the Departmental Student Enrol- ment Plan, only the top ranking applicants will be selected. Once a programme is full, a waiting list will be in place to provide an opportunity for applicants to fill places of those who did not register on time. Applicants will be informed of their status per official letter from the Office of the Registrar, alternatively, they can check their application status on the TUT website, www.tut.ac.za."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "First two years: day classes. Third year: block-mode classes",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "DIPLOMA IN LANGUAGE PRACTICE",
            "qualification_code": "DPLP19",
            "campus_where_offered": "Soshanguve South Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate, with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language) and 4 HUMANITIES Recommended subject(s): Afrikaans, Northern Sotho, Setswana, IsiZulu, Tshiv- enda or Xitsonga.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation). Assessment procedure(s): The department reserves the right to rank appli- cants according to their APS scores and select from this list until the programme complement is full."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day and evening classes. The offering of evening classes is",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "DIPLOMA IN LAW",
            "qualification_code": "DPLW20",
            "campus_where_offered": "Soshanguve South and Mbombela Campuses.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language).",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation). Assessment procedures: No further assessment will be done. Applicants who achieve the minimum APS will be considered until the programme complement is full."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma, endorsement, with at least 50% for Mathematical Literacy, 40% for Life Orientation (excluded for APS calculation) and 50% for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation). Assessment Procedure: No further assessment will be done. Applicants who achieve the minimum APS will be considered until the programme complement is full. Acceptance is subject to available capacity according to the Student Enrolment Plan (SEP). Applicants will be informed of their status per official letter from the Office of the Registrar, alternatively, they can check their application status on the TUT website, www.tut.ac.za."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day and evening classes. Evening classes will only be offered on",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "DIPLOMA IN LEGAL SUPPORT",
            "qualification_code": "DPLE21",
            "campus_where_offered": "Soshanguve South Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language) and 3 for any other additional language.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation)."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 English (home language or first additional language) and 50% for an additional language and 50% for Mathematics or Mathematical Literacy, 40% for Life Orien- tation (excluded for APS calculation) and 50% for any other two compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation). Assessment procedure(s): No further assessment will be done. Applicants who achieve the minimum APS will be considered until the programme complement is full. Acceptance is subject to available capacity according to the Student Enrolment Plan (SEP). Applicants will be informed of their status per official letter from the Office of the Registrar, alternatively, they can check their application status on the TUT website, www.tut.ac.za."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "DIPLOMA IN POLICING",
            "qualification_code": "DPPO20",
            "campus_where_offered": "Soshanguve South Campus and Distance Education",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 3 for English (home language or first additional language) and 3 for Mathematics, Technical Mathematics or Mathematical Literacy. Applicants who are employed in a law enforcement department should have a National Senior Certificate with a bachelor’s degree or a diploma endorse- ment, or an equivalent qualification, with an achievement level of at least 3 for English (home language or first additional language) and 2 for Mathematics, SEITINAMUH",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation). Appli- cants who are employed in a law enforcement department who score between 17 and 19 (with a minimum of five years of work experience) should submit proof of employment (in the form of an official letter from the HR division of the department)."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language) and 50% for Mathematics or Mathematical Literacy, 50% for Life Orientation (excluded for APS calcula- tion), 50% for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation). Appli- cants who are employed in a law enforcement department who score between 17 and 19 (with a minimum of five years of work experience) should submit proof of employment (in the form of an official letter from the HR division of the department). Assessment procedure(s): No further assessment will be done. Acceptance is subject to available capacity according to the Student Enrolment Plan (SEP). Once a programme is full, a waiting list will be in place to provide an oppor- tunity for applicants to fill places of those who did not register on time. Appli- cants will be informed of their status per official letter from the Office of the Registrar, alternatively, they can check their application status on the TUT website, www.tut.ac.za."
                    }
                }
            ],
            "intake_for_qualification": "January only for Soshanguve South Campus and",
            "presentation": "- Soshanguve South Campus (day classes).",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "DIPLOMA IN PUBLIC AFFAIRS",
            "qualification_code": "DPPA20",
            "campus_where_offered": "Soshanguve South, Mbombela and Polokwane",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WHO OBTAINED A NATIONAL SENIOR CERTIFICATE IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 3 for English (home language or first additional language) and 3 for Mathematics or Mathematical Literacy.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation)."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language) and 40% for Mathematics or Mathematical Literacy, 40% for Life Orientation (excluded for APS calcula- tion), 50% for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation). Assessment procedure(s): Please take note that all completed applications received within the published due dates will be ranked. After consideration of the Departmental Student Enrolment Plan, only the top ranking applicants will be selected. Once a programme is full, a waiting list will be in place to provide an opportunity for applicants to fill places of those who did not register on time. Applicants will be informed of their status per official letter from the Office of the Registrar, alternatively, they can check their application status on the TUT website, www.tut.ac.za."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "DIPLOMA IN TRAFFIC SAFETY AND MUNICIPAL POLICE MANAGEMENT",
            "qualification_code": "DPTP19",
            "campus_where_offered": "Soshanguve South, Polokwane Campuses and Distance",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 3 for English (home language or first additional language) and 3 for Mathematics or Mathematical Literacy. Applicants who are employed in a law enforcement department should have a National Senior Certificate with a bachelor’s degree or a diploma endorse- ment, or an equivalent qualification, with an achievement level of at least 3 for English (home language or first additional language) and 2 for Mathematics, Technical Mathematics or Mathematical Literacy.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation). Appli- cants who are employed in a law enforcement department who score between 17 and 19 (with a minimum of five years of work experience) should submit proof of employment (in the form of an official letter from the HR division of the department)."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4, with a bachelor’s degree or diploma endorsement, issued by the Council for Quality Assurance in General and Further Education and Training (Umalusi) with at least a 50% (APS of 4) for English, Mathematics or Mathematical Literacy and Life Orientation (excluded for APS calculation) and 60% (APS of 5) for any other three compulsory vocational subjects and 50% (APS of 4) for the fourth subject.",
                        "Selection criteria": "To be considered for this qualification, Applicants must have an Admission Points Score (APS) of at least 20 (excluding Life Orientation). Applicants who are employed in a law enforcement department who score between 17 and 19 (with a minimum of five years of work experience) should submit proof of employment (in the form of an official letter from the HR division of the department). Assessment pocedures: No further assessment will be done. Acceptance is Once a programme is full, a waiting list will be in place to provide an opportu- nity for applicants to fill places of those who did not register on time. Applicants will be informed of their status per official letter from the Office of the Registrar, alternatively, they can check their application status on the TUT website, www.tut.ac.za."
                    }
                }
            ],
            "intake_for_qualification": "January only for Soshanguve South Campus, Polok-",
            "presentation": "- Soshanguve South and Polokwane campuses (day and block-mode classes).",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "15 June."
        }
    ],
    "Faculty of Information and Communication": [
        {
            "course_name": "DIPLOMA IN COMPUTER SCIENCE",
            "qualification_code": "DPRS20",
            "campus_where_offered": "Soshanguve South, eMalahleni and Polokwane Campuses.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language) and 5 for Mathematics or Technical Mathematics or 7 for Mathemati- cal Literacy. Recommended subjects: Information Technology.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 26 (with Mathematics or Technical Mathematics) or 28 (with Mathematical Literacy). Applicants with a score of 23 (with Mathematics or Technical Mathematics) or 25 (with Mathematical Litera- cy) will be considered for the extended programme. Life Orientation is exclud- ed for APS calculation. Candidates who successfully completed the National Diploma: Information Technology (Extended) might also be considered. Assessment procedures: No further assessment will be done. Applicants who achieve the minimum APS will be considered until the programme complement is full."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% (APS of 4) for English (home language or first additional language) and 60% for Mathe- matics or 80% (APS of 7) for Mathematical Literacy, 50% for Life Orientation (excluded for APS calculation), 50% (APS of 4) for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 26 (with Mathematics) or 28 (with Mathematical Literacy). Applicants with a score of 23 (with Mathematics) or 25 (with Mathematical Literacy) will be considered for the extended programme. Life Orientation is excluded for APS calculation. Candidates who successfully completed the National Diploma: Information Technology (Extended) might also be considered. Assessment procedures: No further assessment will be done. Applicants who achieve the minimum APS will be considered until the programme complement is full."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes. Classes and assessments take place during the week",
            "minimum_duration": "Four years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN COMPUTER SYSTEMS ENGINEERING",
            "qualification_code": "DPYE20",
            "campus_where_offered": "Soshanguve South Campus",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first addition- al language), 5 for Mathematics or Technical Mathematics and 4 for Physical Sciences or Technical Sciences.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 26 (with Mathematics or Technical Mathematics). Applicants with a score of 23 (with Mathematics or Technical Mathematics) will be considered for the extended programme. Life Orientation is excluded for APS calculation."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% (APS of 4) for English (home language or first additional language) and 60% for Mathemat- ics or Mathematical Literacy, 50% (APS of 4) for Physical Science or Applied Engineering Technology, 50% for Life Orientation (excluded for APS calculation), and 50% (APS of 4) for any two compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 26. Applicants with a score of 23 will be considered for the extended programme."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes. Classes and assessments take place during the week",
            "minimum_duration": "Four years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN INFORMATICS",
            "qualification_code": "DPIF20",
            "campus_where_offered": "Soshanguve South Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% (APS of 4) for English (home language or first additional language) and 60% (APS of 5) for Mathematics or 80% (APS of 7) for Mathematical Literacy, and 50% for Life Orientation (excluded for APS calculation), and 50% (APS of 4) for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 26 (with Mathematics) or 28 (with Mathematical Literacy). Applicants with a score of 23 (with Mathematics) or 25 (with Mathematical Literacy) will be considered for the extended programme. Life Orientation is excluded for APS calculation. Candidates who successfully completed the National Diploma: Information Technology (Extended) might also be considered. Assessment procedure(s): No further assessment will be done. Applicants who achieve the minimum APS will be considered until the programme complement is full."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes. Classes and assessments take place during the week",
            "minimum_duration": "Four years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN INFORMATION TECHNOLOGY",
            "qualification_code": "DPIT20",
            "campus_where_offered": "Soshanguve South Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an language) and 5 for Mathematics or Technical Mathematics or 7 for Mathemati- cal Literacy and 3 for Physical Science or Technical Science. Recommended subjects: None.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 26 (with Mathematics or Technical Mathematics) or 28 (with Mathematical Literacy). Applicants with a score of 23 (with Mathematics or Technical Mathematics) or 25 (with Mathematical Litera- cy) will be considered for the extended programme. Life Orientation is exclud- ed for APS calculation. Candidates who successfully completed the National Diploma: Information Technology (Extended) might also be considered. Assessment procedures: No further assessment will be done. Applicants who achieve the minimum APS will be considered until the programme complement is full."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) with a bache- lor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language) and 60% (APS of 5) for Mathematics or 80% (APS of 7) for Mathematical Literacy , 50% for Life Orientation (excluded for APS calculation) and 40% (APS of 3) for Physical Science/Applied Engineering Technology at least 50% (APS of 4) in any two other vocational subjects",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 26 (with Mathematics) or 28 (with Mathematical Literacy). Life Orientation is excluded for APS calculation. Assessment procedures: No further assessment will be done. Applicants who achieve the minimum APS will be considered until the programme complement is full."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes. Classes and assessments take place during the week",
            "minimum_duration": "Four years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN MULTIMEDIA COMPUTING",
            "qualification_code": "DPMC20",
            "campus_where_offered": "Soshanguve South Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language), 5 for Mathematics or Technical Mathematics or 7 for Mathematical Literacy. Recommended subjects: Information Technology.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 26 (with Mathematics or Technical Mathematics) or 28 (with Mathematical Literacy). Applicants with a score of 23 (with Mathematics) or 25 (with Mathematical Literacy) will be considered for the extended programme. Life Orientation is excluded for APS calculation. Candidates who successfully completed the National Diploma: Information Technology (Extended) might also be considered. Assessment procedures: No further assessment will be done. Applicants who achieve the minimum APS will be considered until the programme complement is full."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% (APS of 4) for English (home language or first additional language) and 60% for Mathe- matics or 80% (APS of 7) for Mathematical Literacy, 50% for Life Orientation (excluded for APS calculation), and 50% (APS of 4) for any three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 26 (with Mathematics) or 28 (with Mathematical Literacy). Applicants with a score of 23 (with Mathematics) or 25 (with Mathematical Literacy) will be considered for the extended programme. Life Orientation is excluded for APS calculation. Candidates who successfully completed the National Diploma: Information Technology (Extended) might also be considered. Assessment procedures: No further assessment will be done. Applicants who achieve the minimum APS will be considered until the programme complement is full."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes. Classes and assessments take place during the week",
            "minimum_duration": "Four years.",
            "closing_date_for_application": "30 September."
        }
    ],
    "Faculty of Management Sciences": [
        {
            "course_name": "DIPLOMA IN ADMINISTRATIVE INFORMATION MANAGEMENT",
            "qualification_code": "DPIM19",
            "campus_where_offered": "Pretoria, eMalahleni and Polokwane Campuses.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language) and 3 for Mathematics or Technical Mathematics or Mathematical Literacy.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 19 (excluding Life Orientation). Assessment procedure(s): applicants with a final APS of 22 and more will be admitted to the programme."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language), and 40% for Mathematics or Mathematical Literacy, and 40% for Life Orientation (excluded for APS calcu- lation), and 50% for any other three compulsory vocational subjects. The certificate must be in any of the following fields: accounting, computer science, economics, finance, hospitality, information technology, management, marketing, office administration or tourism.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 22 (excluding Life Orientation)."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN ADVENTURE TOURISM MANAGEMENT",
            "qualification_code": "DPAV19",
            "campus_where_offered": "Mbombela Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification with an achievement level of at least 4 for English (home language or first additional language) and 3 for Mathematics or Technical Mathematics or 4 for Mathemati- cal Literacy. Recommended subject(s): Business Studies, Geography and Tourism Studies.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation). Assessment procedures: Applicants with a final APS of 25 and more will be admitted to the programme. Applicants with a score of 20 to 24 may be invited SECNEICS TNEMEGANAM"
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language), and 40% for Mathematics or 50% for Mathematical Literacy, and 40% for Life Orientation (excluded for APS calculation), and 50% for any other three compulsory vocational subjects. The certificate must be in any of the following fields: accounting, computer science, economics, finance, hospitality, information technology, management, marketing, office administration or tourism.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 25 (excluding Life Orientation). Assessment procedure(s): Applicants with a final APS of 25 and more will be admitted to the programme. Applicants with a score of 20 to 24 may be invited to do the TUT potential assessment."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN CASINO RESORT MANAGEMENT",
            "qualification_code": "DPCA24",
            "campus_where_offered": "Pretoria Campus",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification with an achievement level of at least 4 for English (home language or first additional language) and 3 for Mathematics or Technical Mathematics or Mathematical Literacy.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 19 (excluding Life Orientation). Assessment procedure(s): applicants with a final APS of 22 and more will be admitted to the programme."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language), and 40% for Mathematics or Mathematical Literacy, and 40% for Life Orientation (excluded for APS calcu- lation), and 50% for any other three compulsory vocational subjects. The certificate must be in any of the following fields: accounting, computer science, economics, finance, hospitality, information technology, management, marketing, office administration or tourism.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 22 (excluding Life Orientation). Assessment procedure(s): applicants with a final APS of 22 and more will be admitted to the programme."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN CREDIT MANAGEMENT",
            "qualification_code": "DPCR19",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification with an achievement level of at least 4 for English (home language or first additional language), 3 for Mathematics or Technical Mathematics or 4 for Mathematical Literacy and 3 for Accounting. Recommended subject(s): Mathematics and Commercial subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 24 (excluding Life Orientation). Assessment procedures: Applicants with a final APS of 24 and more will be admitted to the programme."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language), and 40% for Mathemat- ics or 50% for Mathematical Literacy, and 40% for Applied Accounting, and 40% for Life Orientation (excluded for APS calculation), and 50% for any other two compulsory vocational subjects. The certificate must be in any of the following fields: accounting, computer science, economics, finance, hospitality, information technology, management, marketing, office administration or tourism.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 24 (excluding Life Orientation). Assessment procedure(s): Applicants with a final APS of 24 and more will be admitted to the programme."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN ECOTOURISM MANAGEMENT",
            "qualification_code": "DPEC19",
            "campus_where_offered": "Mbombela Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification with an achievement level of at least 4 for English (home language or first additional language) and 3 for Mathematics or Technical Mathematics or 4 for Mathemati- cal Literacy. Recommended subject(s): Business Studies, Geography, Hospitality Studies, Life Sciences and Tourism.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation). Assessment procedures: Applicants with a final APS of 25 and more will be admitted to the programme. Applicants with a score of 20 to 24 may be invited to do the TUT potential assessment."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language), and 40% for Mathematics or 50% for Mathematical Literacy, and 40% for Life Orientation (excluded for APS calculation), and 50% for any other three compulsory vocational subjects. MANAGEMENT SCIENCES science, economics, finance, hospitality, information technology, management, marketing, office administration or tourism.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 25 (excluding Life Orientation). Assessment procedure(s): Applicants with a final APS of 25 and more will be admitted to the programme. Applicants with a score of 20 to 24 may be invited to do the TUT potential assessment."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN ENTREPRENEURSHIP",
            "qualification_code": "DPEN20",
            "campus_where_offered": "Pretoria, eMalahleni and Polokwane Campuses.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification with an achievement level of at least 4 for English (home language or first additional language), 3 for Mathematics or Technical Mathematics or Mathematical Literacy. Recommended subject(s): Commercial subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 24 (excluding Life Orientation)."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) with a bache- lor’s degree or a diploma, or a higher certificate endorsement, with at least 50% for English (home language or first additional language) and 40% for Mathemat- ics or Mathematical Literacy, 40% for Life Orientation (excluded for APS calcula- tion) and 50% for any other three compulsory vocational subjects. The certificate must be in any of the following fields: management, marketing, hospitality, tourism, office administration, information technology, computer science, finance, economics or accounting.",
                        "Selection criteria": "To be considered for this qualification, applicants must have Assessment procedures: No further assessment will be done. Applicants who achieve the minimum APS will be accepted until the programme complement is full. Acceptance is subject to available capacity according to the Student Enrolment Plan (SEP). Once a programme is full, a waiting list will be in place to provide an opportunity for applicants to fill places of those who did not register on time. Applicants will be informed of their status per official letter from the Office of the Registrar, alternatively, they can check their application status on the TUT website, www.tut.ac.za."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three classes.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN EVENT MANAGEMENT",
            "qualification_code": "DPET19",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification with an achievement level of at least 4 for English (home language or first additional language) and 3 for Mathematics or Technical Mathematics or 4 for Mathemati- cal Literacy. Recommended subject(s): Business Studies, Hospitality Studies and Tourism.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation). Assessment procedures: Applicants with a final APS of 25 and more will be admitted to the programme. Applicants with a score of 20 to 24 may be invited"
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language), and 40% for Mathematics or 50% for Mathematical Literacy, and 40% for Life Orientation (excluded for APS calculation), and 50% for any other three compulsory vocational subjects. The certificate must be in any of the following fields: accounting, computer science, economics, finance, hospitality, information technology, management, marketing, office administration or tourism.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 25 (excluding Life Orientation). Assessment procedure(s): Applicants with a final APS of 25 and more will be admitted to the programme. Applicants with a score of 20 to 24 may be invited to do the TUT potential assessment."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN FOOD OPERATIONS MANAGEMENT",
            "qualification_code": "DPFM19",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 3 for English (home language or first additional language) and 3 for Mathematics or Technical Mathematics or Mathematical SECNEICS TNEMEGANAM",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation). Recommended subject(s): None. Assessment procedures: Applicants with a final APS of 24 and more will be admitted to the programme. Applicants with a score of 20 to 23 will be required to do the TUT potential assessment."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language), and 40% for Mathematics or Mathematical Literacy, and 40% for Life Orientation (excluded for APS calcu- lation), and 50% for any other three compulsory vocational subjects. The certificate must be in any of the following fields: accounting, computer science, economics, finance, hospitality, information technology, management, marketing, office administration or tourism.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 24 (excluding Life Orientation). Assessment procedure(s): Applicants with a final APS of 24 and more will be admitted to the programme. Applicants with a score of 20 to 23 will be required to do the TUT potential assessment."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN HOSPITALITY MANAGEMENT",
            "qualification_code": "DPHM19",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 3 for English (home language or first additional language) and 3 for Mathematics or Technical Mathematics or Mathematical Literacy. Recommended subject(s): None.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 23 (excluding Life Orientation). Assessment procedures: Applicants with a final APS of 23 and more will be admitted to the programme."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language), and 40% for Mathematics or Mathematical Literacy, and 40% for Life Orientation (excluded for APS calcu- lation), and 50% for any other three compulsory vocational subjects. The certificate must be in any of the following fields: accounting, computer science, economics, finance, hospitality, information technology, management, marketing, office administration or tourism.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 23 (excluding Life Orientation). Assessment procedure(s): Applicants with a final APS of 23 and more will be admitted to the programme."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN HUMAN RESOURCE MANAGEMENT",
            "qualification_code": "DPHR19",
            "campus_where_offered": "Not specified",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification with an achievement level of at least 4 for English (home language or first additional language) and 3 for Mathematics or Technical Mathematics or Mathematical Literacy.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 24 (excluding Life Orientation). Assessment procedures: Applicants with a final APS of 24 and more will be admitted to the programme."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language), and 40% for Mathemat- ics or Mathematical Literacy, and 40% for Life Orientation (excluded for APS calculation), and 50% for any other three compulsory vocational subjects. The certificate must be in any of the following fields: accounting, computer science, economics, finance, hospitality, information technology, management, marketing, office administration or tourism.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 24 (excluding Life Orientation). Assessment procedure(s): Applicants with a final APS of 24 and more will be admitted to the programme."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN OPERATIONS MANAGEMENT",
            "qualification_code": "DPOM19",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification with an achievement level of at least 3 for English (home language or first additional language) and 3 for Mathematics or Technical Mathematics or 5 for Mathematical Literacy. Recommended subject(s): None.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation). Assessment procedure(s): Applicants with a score of 24 will be considered for admission. Applicants with a score of 20 - 23 will be kept on a waiting list from which the applicants with the highest APS will be selected."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes for the first two years and evening classes for the",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN RETAIL BUSINESS MANAGEMENT",
            "qualification_code": "DPRB19",
            "campus_where_offered": "Pretoria Campus and Online Presentation",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s achievement level of at least 4 for English (home language or first additional language) and 3 for Mathematics or Technical Mathematics or 4 for Mathemati- cal Literacy. Recommended subject(s): None.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 22 (excluding Life Orientation). Assessment procedures: Applicants with a final APS of 24 and more will be admitted to the programme. Applicants with a score of 22 to 23 will be required to do the TUT potential assessment."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language), and 40% for Mathematics or 50% for Mathematical Literacy, and 40% for Life Orientation (excluded for APS calculation), and 50% for any other three compulsory vocational subjects. The certificate must be in any of the following fields: accounting, computer science, economics, finance, hospitality, information technology, management, marketing, office administration or tourism.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 24 (excluding Life Orientation). Assessment procedure(s): Applicants with a final APS of 24 and more will be admitted to the programme. Applicants with a score of 22 to 23 will be required to do the TUT potential assessment."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes and online presentation. Online presentation is only",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN SPORT MANAGEMENT",
            "qualification_code": "DPSM19",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification with an achievement level of at least 4 for English (home language or first additional language) and 3 for Mathematics or Technical Mathematics or 4 for Mathemati- cal Literacy. Recommended subject(s): Accounting, Business Studies and Economics.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 22 (excluding Life Orientation). Assessment procedures: Applicants with a final APS of 24 and more will be admitted to the programme. Applicants with a score of 22 to 23 will be required to do the TUT potential assessment."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language), and 40% for Mathematics or 50% for Mathematical Literacy, and 40% for Life Orientation (excluded for APS calculation), and 50% for any other three compulsory vocational subjects. The certificate must be in any of the following fields: accounting, computer science, economics, finance, hospitality, information technology, management, marketing, office administration or tourism.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 24 (excluding Life Orientation). Assessment procedure(s): Applicants with a final APS of 24 and more will be admitted to the programme. Applicants with a score of 22 to 23 will be required to do the TUT potential assessment."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN SUPPLY CHAIN MANAGEMENT",
            "qualification_code": "DPSU19",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification with an achievement level of at least 4 for English (home language or first additional language) and 3 for Mathematics or Technical Mathematics or 4 for Mathemati- cal Literacy. Recommended subject(s): Commercial subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 22 (excluding Life Orientation). Assessment procedures: Applicants with a final APS of 24 and more will be admitted to the programme. Applicants with a score of 22 to 23 will be required to do the TUT potential assessment."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language), and 40% for Mathematics or 50% for Mathematical Literacy, and 40% for Life Orientation (excluded for APS calculation), and 50% for any other three compulsory vocational subjects. The certificate must be in any of the following fields: accounting, computer science, economics, finance, hospitality, information technology, management, marketing, office administration or tourism.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 24 (excluding Life Orientation). Assessment procedure(s): Applicants with a final APS of 24 and more will be admitted to the programme. Applicants with a score of 22 to 23 will be required to do the TUT potential assessment. MANAGEMENT SCIENCES"
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN TOURISM MANAGEMENT",
            "qualification_code": "DPTM19",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification with an achievement level of at least 4 for English (home language or first additional language) and 3 for Mathematics or Technical Mathematics or 4 for Mathemati- cal Literacy. Recommended subject(s): Business Studies, Geography, Hospitality Studies and Travel and Tourism.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 22 (excluding Life Orientation). Assessment procedures: Applicants with a final APS of 26 and more will be admitted to the programme. Applicants with a score of 22 to 25 may be invited to do the TUT potential assessment."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language), and 40% for Mathematics APS calculation), and 50% for any other three compulsory vocational subjects. The certificate must be in any of the following fields: accounting, computer science, economics, finance, hospitality, information technology, management, marketing, office administration or tourism.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 26 (excluding Life Orientation). Assessment procedure(s): Applicants with a final APS of 26 and more will be admitted to the programme. Applicants with a score of 22 to 25 may be invited to do the TUT potential assessment."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN WORK STUDY",
            "qualification_code": "DPWY24",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification with an achievement level of at least 3 for English (home language or first additional language) and 3 for Mathematics or Technical Mathematics or 5 for Mathemati- cal Literacy.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20 (excluding Life Orientation). Assessment procedure(s): Applicants with a score of 24 will be considered for admission. Applicants with a score of 20 - 23 will be kept on a waiting list from which the applicants with the highest APS will be selected."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language), and 40% for Mathematics or 60% for Mathematical Literacy, and 40% for Life Orientation (excluded for APS calculation), and 50% for any other three compulsory vocational subjects. The certificate must be in any of the following fields: accounting, computer science, economics, finance, hospitality, information technology, management, marketing, office administration or tourism.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20. Assessment procedure(s): - Applicants with a score of 24 will be considered for admission. - Applicants with a score of 20 - 23 will be kept on a waiting list from which the applicants with the highest APS will be selected."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes. The module Organisational Effectiveness III is",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        }
    ],
    "Faculty of Science": [
        {
            "course_name": "BACHELOR OF HEALTH SCIENCES IN BIOKINETICS",
            "qualification_code": "BPBK24",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WHO OBTAINED A NATIONAL SENIOR CERTIFICATE IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate or an equivalent quali- fication, with a bachelor’s degree endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language), 4 for Mathematics or Technical Mathematics, 4 for Physi- cal Sciences or Technical Sciences and 4 for Life Sciences.",
                        "Selection criteria": "To be considered for this qualification, candidates must have an Admission Point Score (APS) of at least 24 (excluding Life Orientation). Assessment procedure(s): Applicants will be invited for a TUT Potential Assessment Test and depending on the results will be invited for an interview. Structured panel interviews are conducted by the full-time academic staff in qualified clinical technology part-time staff from industry to further streamline admission to the programme. The APS will contribute 40%, the TUT Potential Assessment will contribute 20% and the interview will contribute 40% of the final score."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Four years.",
            "closing_date_for_application": "15 June."
        },
        {
            "course_name": "BACHELOR OF HEALTH SCIENCE IN MEDICAL ORTHOTICS AND PROSTHETICS",
            "qualification_code": "BPOP20",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WHO OBTAINED A NATIONAL SENIOR CERTIFICATE IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate or an equivalent quali- fication, with a bachelor’s degree endorsementor an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language), 4 for Life Sciences, 4 for Mathematics or Technical Mathe- matics and 4 for Physical Sciences or Technical Sciences.",
                        "Selection criteria": "To be considered for this qualification, candidates must have an Admission Point Score (APS) of at least 24 (excluding Life Orientation). Assessment procedure(s): The selection process will consist of the following phases:"
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Four years.",
            "closing_date_for_application": "15 June."
        },
        {
            "course_name": "BACHELOR OF HEALTH SCIENCE IN VETERINARY TECHNOLOGY",
            "qualification_code": "BPVT20",
            "campus_where_offered": "Arcadia Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WHO OBTAINED A NATIONAL SENIOR CERTIFICATE IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate or an equivalent quali- fication, with a bachelor’s degree endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language), 4 for Mathematics or Technical Mathematics, 4 for Physi- cal Sciences or Technical Sciences and 4 for Life Sciences or a 4 for Agricultural Sciences.",
                        "Selection criteria": "To be considered for this qualification, candidates must have an Admission Point Score (APS) of at least 24 (excluding Life Orientation). Assessment procedure(s): Applicants will be invited for a TUT Potential Assess- ment Test (TUTPTA) and depending on the results will be invited for an inter- view. The APS will contribute 40%, the TUT Potential Assessment will contribute 20% and the interview will contribute 40% of the final score."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes. This programme consists of formal tuition and Work-",
            "minimum_duration": "Four years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "BACHELOR OF NURSING",
            "qualification_code": "BPNS20",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WHO OBTAINED A NATIONAL SENIOR CERTIFICATE IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate or an equivalent quali- fication, with a bachelor’s degree endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language), 4 for Mathematics or Technical Mathematics, 4 for Physi- cal Sciences or Technical Sciences and 4 for Life Sciences.",
                        "Selection criteria": "To be considered for this qualification, candidates must have an Admission Point Score (APS) of at least 24 (excluding Life Orientation). Assessment procedure(s): Applicants will be invited for a TUT Potential Assess- ment Test (TUTPTA) and depending on the results will be invited for an inter- view. The APS will contribute 60%, the TUT Potential Assessment will contribute 20% and the interview will contribute 20% of the final score."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes offered in blocks as determined by the Department.",
            "minimum_duration": "Four years.",
            "closing_date_for_application": "15 June."
        },
        {
            "course_name": "BACHELOR OF SCIENCE IN INDUSTRIAL CHEMISTRY",
            "qualification_code": "BPIY20",
            "campus_where_offered": "Arcadia Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first addition- al language), 4 for Mathematics or Technical Mathematics and 4 for Physical Sciences or Technical Sciences.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 21 (excluding Life Orientation). Assessment procedures: - Applicants with a score of 27 and more will be considered for admission. - Applicants with a score of 21 to 26 will be kept on a waiting list from which the applicants with the highest scores will be selected. Waiting lists will be cleared at the end of September."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for SCIENCE 40% for Life Orientation (excluded for APS calculation), 50% for Sciences, 50% in any two compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 21 (excluding Life Orientation). Assessment procedures: - Applicants with a score of 27 and more will be considered for admission. - Applicants with a score of 21 to 26 will be kept on a waiting list from which the applicants with the highest scores will be selected. Waiting lists will be cleared at the end of September."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "DIPLOMA IN ANIMAL SCIENCES",
            "qualification_code": "DPAA19",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language) and 3 for Mathematics or Technical Mathematics or 4 for Mathemati- cal Literacy. Recommended subject(s): Preference will be given to applicants with Agricul-",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 19 (with Mathematics or Technical Mathematics) or 20 (with Mathematical Literacy). Life Orientation is excluded from the APS calculation. Assessment procedures: - Applicants with a score of 23 and more will be considered for admission. - Applicants with a score of 20 (19 with Mathematics) to 23 will be kept on a waiting list from which the applicants with the highest APS will be selected. Waiting lists will be cleared at the end of September and November."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language) and 40% for Mathematics or 50% for Mathematical Literacy, 40% for Life Orientation (excluded for APS calculation), and 50% for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 19 (with Mathematics) or 20 (with Mathematical Literacy). Life Orientation is excluded from the APS calculation. Assessment procedure(s): - Applicants with a score of 23 and more will be considered for admission. - Applicants with a score of 20 (19 with Mathematics) to 23 will be kept on a waiting list from which the applicants with the highest APS will be selected. Waiting lists will be cleared at the end of September and November."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "31 July"
        },
        {
            "course_name": "DIPLOMA IN BIOTECHNOLOGY",
            "qualification_code": "DPBI19",
            "campus_where_offered": "Arcadia Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first addition- al language) and 4 for Mathematics or Technical Mathematics, 4 for Physical Sciences or Technical Sciences and 3 for Life Sciences. Recommended subject(s): None.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 21 (excluding Life Orientation). Assessment Procedure: Applicants with a score of 24 or more will be automati- cally accepted. Applicants with a score of 21 to 23 will be considered for admis- sion, and will be invited to write an academic proficiency test. The APS will contribute 80% to the final admission score and the academic proficiency test will contribute 20%."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "DIPLOMA IN CROP PRODUCTION",
            "qualification_code": "DPCP19",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language) and 3 for Mathematics or Technical Mathematics or 4 for Mathemati- cal Literacy. Recommended subject(s): Agricultural subjects. Preference will be given to applicants with Life Sciences and/or Physical Sciences.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 19 (with Mathematics or Technical Mathematics) or 20 (with Mathematical Literacy). Life Orientation is excluded from the APS calculation. Assessment procedures: - Applicants with a score of 23 and more will be considered for admission. - Applicants with a score of 20 (19 with Mathematics or Technical Mathematics) to 22 will be kept on a waiting list from which the applicants with the highest APS will be selected. Waiting lists will be cleared at the end of September and November."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language) and 40% for Mathematics or 50% for Mathematical Literacy, 40% for Life Orientation (excluded for APS calculation), and 50% for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 19 (with Mathematics) or 20 (with Mathematical Literacy). Life Orientation is excluded from the APS calculation."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "DIPLOMA IN DENTAL TECHNOLOGY",
            "qualification_code": "DPDT24",
            "campus_where_offered": "Pretoria Campus",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language) and 3 for Mathematics or Technical Mathematics or 4 for Mathemati- cal Literacy. Recommended subject(s): Agricultural Science subjects, Life Sciences, Mathe- matics and Physical Science.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 19 (with Mathematics or Technical Mathematics) or 20 (with Mathematical Literacy). Life Orientation is excluded from the APS calculation. Assessment procedures(s): - Applicants with a score of 23 and more will be considered for admission. - Applicants with a score of 20 (19 with Mathematics or Technical Mathematics) to 23 will be kept on a waiting list from which the applicants with the highest APS will be selected. Waiting lists will be cleared at the end of September and November."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language) and 40% for Mathematics or 50% for Mathematical Literacy, 40% for Life Orientation (excluded for APS calculation), and 50% for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 19 (with Mathematics) or 20 (with ECNEICS Assessment procedures(s): - Applicants with a score of 23 and more will be considered for admission. - Applicants with a score of 20 (19 with Mathematics or Technical Mathematics) to 23 will be kept on a waiting list from which the applicants with the highest APS will be selected. Waiting lists will be cleared at the end of September and November."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN FIRE TECHNOLOGY",
            "qualification_code": "DPFI19",
            "campus_where_offered": "Arcadia Campus and Distance Education.",
            "Admission requirement(s) and Selection criteria": [],
            "intake_for_qualification": "January only.",
            "presentation": "- Arcadia Campus: block-mode classes offered over a minimum of three years.",
            "minimum_duration": "A minimum of three or four years (depending on the",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "DIPLOMA IN FOOD TECHNOLOGY",
            "qualification_code": "DPFT19",
            "campus_where_offered": "Arcadia Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first addition- al language), 4 for Mathematics or Technical Mathematics and 4 for Physical Sciences or Technical Sciences. Recommended subject(s): Computer Applications Technology, Geography and/ or Information Technology.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 21 (excluding Life Orientation). Assessment procedures: - Applicants with a score of 24 and more will be considered for admission. - Applicants with a score of 21 to 23 will be invited to do an academic profi- ciency test. The APS will contribute 80% to the final admission score and the academic proficiency test, will contribute 20%."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQG Level 4 with a bachelor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language) and 50% for Mathematics, 40% for Life Orientation (excluded for APS calculation), 50% for Sciences, and 50% for any other two compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 21 (excluding Life Orientation). Assessment procedures: - Applicants with a score of 24 and more will be considered for admission. - Applicants with a score of 21 to 23 will be invited to do an academic profi- ECNEICS ciency test. The APS will contribute 80% to the final admission score and the academic proficiency test, will contribute 20%."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "DIPLOMA IN HORTICULTURE",
            "qualification_code": "DPHO20",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first additional language) and 3 for Mathematics or Technical Mathematics or 4 for Mathemati- cal Literacy. Recommended subject(s): Agricultural Sciences, Geography, Life Sciences, Physical Sciences or Technical Sciences.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 24 (with Mathematics or Technical Mathematics) or 25 (with Mathematical Literacy). Life Orientation is excluded for APS calculation."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) with a bache- lor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language) and 40% for Mathematics or 50% Mathe- matical Literacy, 40% for Life Orientation (excluded for APS calculation) and 50% for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 24 (with Mathematics or Technical Mathematics) or 25 (with Mathematical Literacy). Assessment Procedure: Applicants with the minimum APS will be considered for admission until the programme complement is full. Acceptance is subject to available capacity according to the Student Enrolment Plan (SEP). Once a programme is full, a waiting list will be in place to provide an opportunity for applicants to fill places of those who did not register on time. Applicants will be informed of their status per official letter from the Office of the Registrar, alternatively, they can check their application status on the TUT website, www.tut.ac.za."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "DIPLOMA IN WATER SCIENCE AND TECHNOLOGY",
            "qualification_code": "DPWS19",
            "campus_where_offered": "Arcadia Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a bachelor’s degree or a diploma endorsement, or an equivalent qualification, with an achievement level of at least 4 for English (home language or first addition- al language), 4 for Mathematics or Technical Mathematics and 4 for Physical Sciences or Technical Sciences. Recommended subject(s): Life Sciences.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 21 (excluding Life Orientation). Assessment procedures: Applicants with an Admission Point Score (APS) of 21 and more will be considered for admission."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "- A National Certificate (Vocational) at NQF Level 4 with a diploma or bache- lor’s degree endorsement, with at least a 50% (APS of 4) for English (home language or first additional language), Mathematics and Science, 40% for Life Orientation (excluded for APS calculation), 50% for any other two compulsory vocational subjects; or ment Process Control Supervision at NQF Level 4.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 21 (excluding Life Orientation). Applicants with a National N Certificate as published in Nated 191: N3 (NQF Level 4): - A National N3 Certificate: with at least 50% for English, 50% for Mathematics N3, Engineering Science N3, and any two additional N3 subjects; or - A Further Education and Training Certificate: Water and Wastewater Treat- ment Process Control Supervision at NQF Level 4."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes.",
            "minimum_duration": "Three years.",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "DIPLOMA IN WILDLIFE MANAGEMENT",
            "qualification_code": "DPWI20",
            "campus_where_offered": "Pretoria Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) with a bache- lor’s degree or a diploma endorsement, with at least 50% for English (home language or first additional language) and 40% for Mathematics or 50% Mathe- matical Literacy, 40% for Life Orientation (excluded for APS calculation) and 50% for any other three compulsory vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 24 (with Mathematics or Technical Mathematics) or 25 (with Mathematical Literacy). Assessment procedure(s): Applicants with the minimum APS will be considered for admission until the programme complement is full. Acceptance is subject to available capacity according to the Student Enrolment Plan (SEP). Once a programme is full, a waiting list will be in place to provide an opportunity for applicants to fill places of those who did not register on time. Applicants will be informed of their status per official letter from the Office of the Registrar, alternatively, they can check their application status on the TUT website, www.tut.ac.za."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day classes offered over one year, block mode classes offered",
            "minimum_duration": "A minimum of one or two years (depending on the",
            "closing_date_for_application": "31 July."
        },
        {
            "course_name": "HIGHER CERTIFICATE IN RESOURCE AND WASTE MANAGEMENT",
            "qualification_code": "HCRW22",
            "campus_where_offered": "Arcadia Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate or an equivalent qualification,with a higher certificate endorsement, with an achievement level of at least 3 for English (home language or first additional language), and 3 for Mathematics or Technical Mathematics, or 6 for Mathematical Literacy.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 18 (with Mathematics or Technical Mathematics) or 21 (with Mathematical Literacy). Life Orientation is excluded from the APS calculation."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a higher certificate endorsement, issued by the Council for Quality Assur- ance in General and Further Education and Training (Umalusi), with at least 50% for English and 50% Mathematics or 70% for Mathematical Literacy, and 40% for Life Orientation (excluded for APS calculation), and 50% for any two vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 18 (with Mathematics or Technical Mathematics) or 21 (with Mathematical Literacy). Life Orientation is excluded from the APS calculation."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE AS PUBLISHED IN NATED 191": {
                        "Admission requirement(s)": "A National Senior Certificate or a National N Certifi- cate as published in Nated 191: N3 (NQF Level 4) issued by both the Department of Higher Education (DHET) and the Council for Quality Assurance in General and Further Education and Training (Umalusi), with at least 50% for English, 50% for Mathematics N3, and any two additional N3 subjects; or any equivalent qualification at NQF Level 4.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 20."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day or block-mode classes.",
            "minimum_duration": "A minimum of one or two years (depending on the",
            "closing_date_for_application": "30 September."
        },
        {
            "course_name": "HIGHER CERTIFICATE IN WATER TREATMENT",
            "qualification_code": "HCWT19",
            "campus_where_offered": "Arcadia Campus.",
            "Admission requirement(s) and Selection criteria": [
                {
                    "• APPLICANTS WITH A NATIONAL SENIOR CERTIFICATE OBTAINED IN OR AFTER 2008": {
                        "Admission requirement(s)": "A National Senior Certificate with a higher certifi- cate endorsement, or an equivalent qualification, with an achievement level of at least 3 for English (home language or first additional language), 3 for Mathematics or Technical Mathematics (or 6 for Mathematical Literacy) and 3 for Physical Sciences or Technical Sciences.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 18 (with Mathematics or Technical Mathematics) or 21 (with Mathematical Literacy). Life Orientation is excluded from the APS calculation. Assessment procedures: Applicants with a score of 18 and more will be consid- ered for admission."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL CERTIFICATE (VOCATIONAL) AT NQF LEVEL 4": {
                        "Admission requirement(s)": "A National Certificate (Vocational) at NQF Level 4 with a higher certificate endorsement, issued by the Council for Quality Assur- ance in General and Further Education and Training (Umalusi), with at least 50% for English and 50% Mathematics or 40% for Mathematical Literacy, and 50% for Sciences, and 40% for Life Orientation (excluded for APS calculation) and 50% for any two vocational subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 18 (with Mathematics) or 21 (with Mathematical Literacy). Life Orientation is excluded from the APS calculation."
                    }
                },
                {
                    "• APPLICANTS WITH A NATIONAL N CERTIFICATE AS PUBLISHED IN NATED 191": {
                        "Admission requirement(s)": "A National Senior Certificate or a National N Certifi- cate as published in Nated 191: N3 (NQF Level 4) issued by both the Department of Higher Education (DHET) and the Council for Quality Assurance in General and Further Education and Training (Umalusi), with at least 50% for English, 50% for Mathematics N3, Engineering Science N3, and any two additional N3 subjects.",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 24."
                    }
                },
                {
                    "• APPLICANTS WITH A N4 CERTIFICATE IN AN ENGINEERING FIELD AS PUBLISHED IN NATED 191": {
                        "Admission requirement(s)": "An N4 Certificate in a related Engineering field as published in Nated 191: N4 issued by both the Department of Higher Educa- tion and Training (DHET) and the Council for Quality Assurance in General and Further Education and Training (Umalusi), with at least 50% for English N3, and SCIENCE",
                        "Selection criteria": "To be considered for this qualification, applicants must have an Admission Point Score (APS) of at least 24."
                    }
                }
            ],
            "intake_for_qualification": "January only.",
            "presentation": "Day and block-mode classes (block-mode classes are only offered",
            "minimum_duration": "A minimum of one or two years depending on the program-",
            "closing_date_for_application": "30 September."
        }
    ]
}